# 70. 爬楼梯
# 难度：简单
# 标签：记忆化搜索、数学、动态规划
#
# 假设你正在爬楼梯。需要 `n` 阶你才能到达楼顶。
#
# 每次你可以爬 `1` 或 `2` 个台阶。你有多少种不同的方法可以爬到楼顶呢？
#
# ### 示例
#
# - 输入：`n = 2`，输出：`2`（1 阶 + 1 阶，或者直接 2 阶）
# - 输入：`n = 3`，输出：`3`（1+1+1、1+2、2+1）
#
# ### 提示
#
# - `1 <= n <= 45`
#
# ### ACM 模式输入输出格式
#
# - 输入：一行，整数 `n`
# - 输出：一个整数，即不同的爬楼方法数
#
# ACM 输入示例：
# ```
# 3
# ```
# 输出：`3`

def climbStairs(n):
    # 返回爬到 n 阶楼顶的不同方法数
    #if n == 1:
    #    return 1
    #if n == 2:
    #    return 2

    #return climbStairs(n - 1) + climbStairs(n - 2) #迭代耗时太长没跑出来结果

    #错误解:
    #a,b = 1,2

    #for _ in range(2,n):
    #    a, b = b,a+b   #遗漏边界1

    a,b = 1,1
    for _ in range(2,n + 1):
        a, b = b,a+b
    
    return b
    pass
